Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: འོན་ཀྱང་ཉིན་མཚན་དུས་དྲུག་ཏུ་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་གུས་པས་ཐལ་མོ་སྦྱར་ཏེ་སེམས་རྩེ་གཅིག་ཏུ་དྲན་པ་ཉེ་བར་བཞག་ནས་རྗེས་སུ་ཡི་རང་བར་བྱེད་ནས་བསོད་ནམས་ཚད་མེད་པ་སྙེད་འཐོབ་པར་འགྱུར་བས་འདི་སྐད་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་གང་དག་ད་ལྟར་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། སེམས་ཀྱི་ཤེས་རབ་མངོན་པར་སྒྲུབ་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ལ་དེང་བདག་ཤིན་ཏུ་དང་བས་རྗེས་སུ་ཡི་རང་ངོ་། །ཞེས་བརྗོད་པར་གྱུར་ན་དེ་ལྟར་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་ཀྱི་དབང་གིས་གདོན་མི་ཟ་བར་ཤིན་ཏུ་བཙུན་ཞིང་ཁྱད་པར་དུ་འཕགས་པ་བླ་ན་མེད་པ་མཚུངས་པ་མེད་པ་མཆོག་ཏུ་གྱ་ནོམ་པའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་རོ།
en: However, if in the six periods of the day and night, with their robe over one shoulder, kneeling on their right knee with palms together in veneration, they rejoice with single-pointed mindfulness, then they will attain measureless merit. “Therefore, if they recite these words: ‘I today rejoice with appreciation in the beings in the world realms in the ten directions who are at present accomplishing generosity, virtuous conduct, and wisdom of the mind,’ then through the power of the merit of rejoicing in that way, they will doubtless attain a noble, superior, unsurpassable, unequaled, sublimely supreme result. “

source: །དེ་བཞིན་དུ་འདས་པ་དང་མ་འོངས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཇི་སྙེད་པ་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བར་བྱའོ།
en: They should also rejoice in that same way in all the good roots of all beings in the past and in the future.

source: །གཞན་ཡང་ད་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་པོ་པས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལས་བྱུང་བའི་བསོད་ནམས་ཇི་སྙེད་པ་དག་དང་། བསྐལ་པ་ཆེན་པོ་བརྒྱ་འདས་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པ་ལས་བྱུང་བའི་བསོད་ནམས་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་སྐྱེ་བའི་བཟོད་པ་ཐོབ་པ་ནས་ཕྱིར་མི་ལྡོག་པ་དང་། ཚེ་གཅིག་གིས་དབང་བསྐུར་བར་འགྱུར་བའི་བར་དག་ལས་བྱུང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་འདི་ལྟར་བསམ་པ་ཐག་པ་ནས་རྗེས་སུ་ཡི་རང་ཞིང་བསྔགས་པ་བརྗོད་པར་བྱའོ།
en: Moreover, they should rejoice in all the merit that comes from the development of the aspiration to enlightenment by bodhisattvas at the beginning of bodhisattva conduct, and in the great merit that has arisen from the practice of bodhisattva conduct over a hundred great eons, from the attainment of irreversibility on attaining the patience of birthlessness, and so on, up to the aggregation of merit that arises from the consecration of having one life remaining—they should rejoice sincerely in all that merit, and recite praises of it. “

source: །དེ་བཞིན་དུ་འདས་པ་དང་། མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཇི་སྙེད་པ་དག་ལ་ཡང་རྗེས་སུ་ཡི་རང་ཞིང་བསྔགས་པ་བརྗོད་པར་བྱའོ།
en: In the same way, they should rejoice in and praise all the merit of all the bodhisattvas in the past and in the future. “

source: །གཞན་ཡང་ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་ཡང་དག་པའི་ཐམས་ཅད་མཁྱེན་པ། བྱང་ཆུབ་གྱ་ནོམ་པ་བརྙེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་སེམས་ཅན་མཐའ་ཡས་པ་རྣམས་ཡོངས་སུ་བཟླ་བའི་ཕྱིར་བླ་ན་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ། ཐོགས་པ་མི་མངའ་བའི་ཆོས་ཀྱི་སྦྱིན་པ་བཏང་བ། ཆོས་ཀྱི་རྔ་བརྡུངས་པ།
en: Moreover, they should recite this: ‘I rejoice in all the buddha bhagavats in the worlds in the ten directions, who have attained true omniscience and sublime enlightenment and are turning the wheel of the highest Dharma in order to completely relate this to endless beings, who give the unimpeded gift of the Dharma, who beat the drum of the Dharma, who blow the conch of the Dharma, who raise the banner of the Dharma, and who send down a rain of the Dharma, compassionately inspiring and guiding all beings, so that they all develop conviction, and through being satisfied by the gift of the Dharma are brought to the attainment of bliss that knows no cessation. “ ‘

source: ཆོས་ཀྱི་དུང་བུས་པ། ཆོས་ཀྱི་རྒྱལ་མཚན་བཙུགས་པ། ཆོས་ཀྱི་ཆར་ཕབ་པ་དག་གིས་ཐུགས་བརྩེ་བས་སེམས་ཅན་ཐམས་ཅད་ལ་བསྐུལ་ཞིང་ཡོངས་སུ་བཏུལ་བས་ཐམས་ཅད་མངོན་པར་ཡིད་ཆེས་པར་གྱུར་ནས་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་མཛད་པའི་དབང་གིས་ཟད་མི་ཤེས་པའི་བདེ་བ་ཐོབ་པ་ལ་བཀོད་པ་གང་ཡིན་པ་དང་། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་བསོད་ནམས་བསགས་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་གིས་འདི་འདྲ་བའི་བསོད་ནམས་ད་དུང་ཕུན་སུམ་ཚོགས་པར་མ་གྱུར་པ་དག་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་དག་ལ་བདག་རྗེས་སུ་ཡི་རང་ངོ་།
en: I also rejoice in the roots of goodness that arise from the accumulation of merit by the bodhisattvas, śrāvakas, and pratyekabuddhas, and I also rejoice in the attainment of that kind of perfection by those beings who had not attained such perfection until now. “ ‘

source: །དེ་བཞིན་དུ་འདས་པ་དང་། མ་བྱོན་པའི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་བསོད་ནམས་ཇི་སྙེད་པ་ཐམས་ཅད་ལ་ཡང་བསམ་པ་ཐག་པ་ནས་རྗེས་སུ་ཡི་རང་ངོ་།
en: In the same way, I rejoice sincerely in all the merit of the buddhas, bodhisattvas, śrāvakas, and pratyekabuddhas of the past and the future.’ “

source: །ཞེས་བརྗོད་པར་བྱའོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ན་རྗེས་སུ་ཡི་རང་བ་གང་ཡིན་པ་དེས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་རྙེད་ཐོབ་པར་འགྱུར་རོ། །གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་མཉམ་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཉོན་མོངས་པ་སྤངས་ཏེ་དགྲ་བཅོམ་པ་མངོན་པར་གྲུབ་པར་གྱུར་ལ། རིགས་ཀྱི་བུའམ།
en: Noble one, that kind of rejoicing will bring the attainment of a measureless aggregation of merit.

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་ནམ་འཚོའི་བར་དུ་རྟག་པར་གོས་དང་། བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་ཆ་དང་། གསོས་སྨན་མཆོག་དམ་པ་རྣམས་ཀྱིས་མཆོད་པ་དང་རིམ་གྲོ་བྱས་པས་འཐོབ་པའི་བསོད་ནམས་གང་ཡིན་པ་དེས་འདི་ལྟར་སྔ་མ་ལྟ་བུར་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་དེ་དང་བསྐྲུན་ན་སྟོང་གི་ཆ་གཅིག་ཙམ་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: If all the beings in the world realms in as many trichiliocosms as there are grains of sand in the Ganges were all to eliminate their kleśas and attain arhatship, and if a noble man or noble woman for the duration of their lives were to continuously give them the offerings and service of robes, food, drink, bedding, and sublime, perfect medicines when they are ill, the merit that they would attain if compared to the previous merit from rejoicing would not come near to being a thousandth part of it. “

source: མཆོད་པ་བྱས་པའི་བསོད་ནམས་གང་ཡིན་པ་དེ་ནི་གྲངས་དང་བཅས་ཤིང་ཚད་དང་བཅས་པས་བསོད་ནམས་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པར་མི་འགྱུར་ལ་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་གང་ཡིན་པ་དེ་ལ་ནི་ཚད་མེད་ཅིང་གྲངས་མེད་པས་དུས་གསུམ་གྱི་བསོད་ནམས་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པར་བྱེད་པས་དེའི་ཕྱིར་གང་ལ་ལ་ཞིག་དགེ་བའི་རྩ་བ་ཁྱད་པར་ཅན་འཕེལ་བར་འདོད་པས་འདི་ལྟར་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: The merit that comes from offering has a number, has a measure, while the merit of rejoicing in the union of all merit is measureless and numberless. Therefore, it unites all the merit of the three times, and so if someone wishes to multiply special roots of goodness, they should accomplish the merit of rejoicing in this way. “

source: །བུད་མེད་གང་ལ་ལ་ཞིག་བུད་མེད་ཀྱི་ལུས་ཡོངས་སུ་བསྒྱུར་ནས་སྐྱེས་པའི་ལུས་ཡོངས་སུ་འགྲུབ་པར་འདོད་ན་ཡང་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་མངོན་པར་སྒྲུབ་པར་བྱེད་ན་གདོན་མི་ཟ་བར་ཡིད་ལ་བསམས་པ་བཞིན་དུ་ཚེ་འདི་ཉིད་ལ་སྐྱེས་པའི་ལུས་མངོན་པར་འགྲུབ་པར་འགྱུར་རོ།
en: If a woman wishes to transform her female body and achieve a male body, then if she accomplishes the merit from rejoicing, without doubt she will truly accomplish becoming a man in that very life exactly as she wished to.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བརྒྱ་བྱིན་ལྷའི་དབང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་གང་ལགས་པ་དེ་ནི་འཚལ་བར་གྱུར་ན་སླད་མའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འགྱུར་བ་དང་། ད་ལྟར་གྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡང་དག་པའི་རྣལ་འབྱོར་སྒོམ་པར་འགྱུར་བར་བགྱིད་པའི་སླད་དུ་བསྐུལ་བ་དང་། གསོལ་བ་བཏབ་པའི་བསོད་ནམས་གང་ལགས་པ་བཤད་དུ་གསོལ།
en: Then Śakra, the lord of devas, said to the Bhagavat, “Bhagavat, having learned the merit that comes from rejoicing, I pray that you teach what merit comes from the supplication that requests bodhisattvas to turn the wheel of the Dharma in the future and bodhisattvas to practice correctly in the present.” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་དབང་པོ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་གཉེར་བ་གང་ཡིན་པ་དེས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། ཐེག་པ་ཆེན་པོའི་ལམ་བསྒོམ་པར་འདོད་ན་ཡང་གང་ཟག་དེས་ཉིན་མཚན་དུས་དྲུག་ཏུ་སྔ་མ་ལྟ་བུའི་སྤྱོད་ལམ་གྱིས་སེམས་རྩེ་གཅིག་དུ་དྲན་པ་ཉེ་བར་གཞག་ནས་འདི་སྐད་དུ་དེང་བདག་ཕྱོགས་བཅུ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བརྙེས་པར་གྱུར་ཀྱང་བླ་ན་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ད་དུང་མ་བསྐོར་བ་དང་། རྣམ་པར་སྨིན་པའི་སྐུ་སྤངས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བཞེད་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་བདག་བསམ་པ་ཐག་པ་ནས་སྤྱི་བོས་བཏུད་དེ་ཕྱག་བགྱིས་ནས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྒྲལ་ཞིང་བདེ་བར་བགྱི་བ་དང་།
en: Lord of devas,” replied the Bhagavat, “if a noble man or noble woman seeks the highest, most complete enlightenment and wishes to meditate on the paths of the śrāvakas, pratyekabuddhas, and bodhisattvas, then that individual, in the six periods of the day and night, as described before, maintaining single-pointed mindfulness, should recite this: “ ‘Today with sincerity I bow down my head in homage to all the buddha bhagavats in the worlds in the ten directions, who have attained the highest, most complete enlightenment but have not yet turned the wheel of the unsurpassable Dharma and are about to discard their karmically ripened body and pass into nirvāṇa.

source: སྔར་གོང་དུ་བསྟན་པ་ལྟར་བས་པ་མ་མཆིས་པའི་བདེ་བ་འཐོབ་པར་བགྱི་བའི་སླད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་ཡོངས་སུ་བསྐོར་བ་དང་། ཆོས་ཀྱི་ཆར་པ་ཆེན་པོ་དབབ་པ་དང་། ཆོས་ཀྱི་སྒྲོན་མ་ཆེན་མོ་སྦར་བ་དང་། དོན་གྱི་ཚུལ་གསལ་བར་མཛད་པ་དང་། ཐོགས་པ་མི་མངའ་བའི་ཆོས་ཀྱི་སྦྱིན་པ་བཏང་ནས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་ཞིང་འཇིག་རྟེན་ན་ཡུན་རིང་དུ་བཞུགས་པར་བསྐུལ་ཞིང་གསོལ་བ་འཚལ་ལོ།
en: So that all beings will be liberated and happy, and, as taught previously, obtain a happiness that they have not preciously had, I pray and request that they turn the great wheel of Dharma, send down a rain of the Dharma, light the great lamp of the Dharma and illuminate the true meaning, give the gift of the Dharma, and not pass into nirvāṇa but remain in the world for a long time.

source: །དེང་བདག་གིས་བསྐུལ་ཞིང་གསོལ་བ་བཏབ་པའི་བསོད་ནམས་གང་ལགས་པ་འདི་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ།
en: All the merit from this request and supplication that I have made today I dedicate to the highest, most complete enlightenment. “ ‘

source: །ཇི་ལྟར་འདས་པ་དང་། ད་ལྟར་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་བསྐུལ་བ་དང་། གསོལ་བ་བཏབ་པའི་བསོད་ནམས་དེ་དག་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་བསྐུལ་བ་དང་གསོལ་བ་བཏབ་པའི་བསོད་ནམས་གང་ལགས་པ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ་ཞེས་བརྗོད་པར་བྱའོ།
en: In the same way that the past and present bodhisattvas mahāsattvas dedicate to enlightenment the merit from their requests and supplications, in that same way I dedicate the merit from my request and supplication to the highest, most complete enlightenment.’ “

source: །རིགས་ཀྱི་བུ་གལ་ཏེ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་པ་བས་གང་ལ་ལ་ཞིག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་བསྐོར་བར་གསོལ་བ་བཏབ་པས་འཐོབ་པའི་བསོད་ནམས་གང་ཡིན་པ་དེ་སྔ་མ་བས་ཆེས་ཁྱད་པར་དུ་འཕགས་ཏེ།
en: Noble one, if someone were to fill the world realms of this trichiliocosm with the seven kinds of jewels and offer them to the tathāgatas, the merit attained through the supplication to the tathāgatas to turn the wheel of the Dharma would be far superior to that.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: དེ་ནི་ཟང་ཟིང་གི་སྦྱིན་པ་ཡིན་ལ་འདི་ནི་ཆོས་ཀྱི་སྦྱིན་པ་ཡིན་པས་སོ།
en: It is because the former is a material gift, while the latter is a gift of the Dharma. “

source: །རིགས་ཀྱི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ་སྦྱིན་པ་བཏང་བ་ལྟ་རེ་ཞིག་ཞོག་གི །གལ་ཏེ་གང་ལ་ལ་ཞིག་གིས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་སྟེ། སངས་རྒྱས་ཐམས་ཅད་ལ་མཆོད་པ་བྱས་པ་བས་བསྐུལ་ཞིང་གསོལ་བ་བཏབ་པའི་བསོད་ནམས་གང་ཡིན་པ་དེ་བས་ཀྱང་ཆེས་ཁྱད་པར་དུ་འཕགས་སོ།
en: Noble one, never mind filling the world realms of this trichiliocosm with the seven kinds of jewels and offering them to the tathāgatas, even if someone were to fill the world realms of as many trichiliocosms as there are grains of sand in the Ganges with the seven kinds of jewels and offer them to all buddhas, the merit attained through the supplication to the buddhas to turn the wheel of the Dharma would be far superior to that. “

source: །ཆོས་ཀྱི་སྦྱིན་པ་ནི་ཁྱད་པར་དུ་འཕགས་པའི་ཕན་ཡོན་རྣམ་པ་ལྔ་དང་ལྡན་ཏེ།
en: There are five superior benefits in a gift of the Dharma.

source: ལྔ་གང་ཞེ་ན།
en: What are those five?

source: དང་པོ་ཆོས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་བདག་དང་གཞན་ལ་ཕན་འདོགས་པར་བྱེད་ལ། ཟང་ཟིང་གི་སྦྱིན་པ་ནི་དེ་ལྟ་མ་ཡིན་པས་སོ།
en: They are as follows: First, the gift of the Dharma is beneficial for oneself and others, but material gifts are not like that.

source: །གཉིས་པ་ཆོས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ཁམས་གསུམ་ནས་འབྱིན་པར་བྱེད་པ་ཡིན་ལ། ཟང་ཟིང་གི་སྦྱིན་པའི་བསོད་ནམས་གང་ཡིན་པ་དེ་ནི་འདོད་པའི་ཁམས་ལས་མི་འདའ་བས་སོ།
en: Second, the gift of the Dharma brings beings out of the three realms, while the merit from a material gift does not transcend the desire realm.

source: །གསུམ་པ་ཆོས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་སྐུ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཡིན་ལ། ཟང་ཟིང་གི་སྦྱིན་པས་ནི་གཟུགས་འབའ་ཞིག་འཕེལ་བར་བྱེད་པས་སོ།
en: Third, the gift of the Dharma purifies the Dharma body, but material gifts only cause an increase in material forms.

source: །བཞི་པ་ཆོས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་དེར་མཐར་ཐུག་པ་མེད་པ་ཡིན་ལ་ཟང་ཟིང་གི་སྦྱིན་པ་ནི་ཟད་པར་འགྱུར་བས་སོ།
en: Fourth, the gift of the Dharma has no end, but material gifts will be used up.

source: །ལྔ་པ་ཆོས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་མ་རིག་པ་ཡོངས་སུ་གཅོད་པར་བྱེད་ལ། ཟང་ཟིང་གི་སྦྱིན་པ་ནི་འདོད་པའི་སྲིད་པ་ཙམ་ཐུལ་བར་འགྱུར་བས་སོ།
en: Fifth, the gift of the Dharma eliminates ignorance, but material gifts only overcome the craving of desire. “

source: །དེ་ལྟ་བས་ན་རིགས་ཀྱི་བུ་བསྐུལ་བ་དང་། གསོལ་བ་བཏབ་པའི་བསོད་ནམས་ནི་ཚད་མེད་དཔག་ཏུ་མེད་པས་དཔེ་བྱར་སླ་བ་མ་ཡིན་ནོ།
en: Therefore, noble one, the merit from requesting and supplicating is measureless, cannot be quantified, and has no easy analogy. “

source: །ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་ཡོངས་སུ་བསྐོར་བར་བསྐུལ་བས་དགེ་བའི་རྩ་བ་དེའི་དབང་གིས་དེ་ལྟ་བས་ན་དེང་བརྒྱ་བྱིན་དང་། ཚངས་པའི་རྒྱལ་པོ་ལ་སོགས་པས་ང་ལ་ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་ཡོངས་སུ་བསྐོར་བར་གསོལ་བ་བཏབ་པ་ཡིན་ཏེ།
en: It is through the roots of goodness from requesting the tathāgatas to turn the great wheel of the Dharma when I was practicing bodhisattva conduct in the past that in this time Śakra, the king of the Brahmā devas, and so on, prayed that I turn the great wheel of the Dharma. “

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བསྐོར་བར་བསྐུལ་བ་ནི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྒྲོལ་ཞིང་བདེ་བར་བྱེད་པ་ཡིན་པའི་ཕྱིར་རོ།
en: Noble one, this is because the request for the Dharma wheel to be turned is for the sake of the liberation and happiness of beings. “

source: །ང་སྔོན་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་འཇིག་རྟེན་ན་ཡུན་རིང་དུ་བཞུགས་ཤིང་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བར་གསོལ་བ་བཏབ་པས་ན་དགེ་བའི་རྩ་བ་དེ་ལ་བརྟེན་ནས་ངས་སྟོབས་བཅུ་དང་། བསྙེངས་པ་མི་མངའ་བ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། མ་འདྲེས་པའི་ཆོས་གྲངས་མེད་པ་སྙེད་བརྙེས་པར་གྱུར་པ་ཡིན་ཏེ། ང་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་ཡང་། ངའི་ཡང་དག་པའི་ཆོས་འཇིག་རྟེན་ན་ཡུན་རིང་བར་གནས་པར་འགྱུར་བ་ཡིན་ནོ།
en: It is through the roots of goodness from requesting the tathāgatas to remain for a long time in the world and not pass into nirvāṇa while I was practicing bodhisattva conduct in the past that I have attained the ten strengths, the four confidences, the four discernments, great love, great compassion, and countless unique qualities, and even though I will pass into the nirvāṇa that is the nirvāṇa without a remainder, my true Dharma will remain in the world for a long time.

source: །ངའི་ཆོས་ཀྱི་སྐུ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་དག་ཅིང་དཔེ་ཟླ་མེད་པས་མཚན་མཆོག་དམ་པ་སྣ་ཚོགས་དང་། མཁྱེན་པ་ཚད་མེད་པ་དང་། དབང་ཚད་མེད་པ་དང་། ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚད་མེད་པ་དང་ལྡན་ཞིང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་འདོགས་པར་མཛད་པས་བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་སྙེད་དུ་བརྗོད་ཀྱང་མཐར་ཐུག་པར་མི་འགྱུར་རོ།
en: My Dharma body is pure and has no analogy; it has various sublime, perfect features, limitless knowledge, limitless powers, and limitless inconceivable qualities, and it benefits all beings, so that one could not finish describing it in a quintillion eons. “

source: །ཆོས་ཀྱི་སྐུས་ནི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པར་མཛད་ལ་ཆོས་ཐམས་ཅད་ཀྱིས་ནི་ཆོས་ཀྱི་སྐུ་ཡོངས་སུ་སྡུད་པར་མི་བྱེད་དོ།
en: The Dharma body contains all Dharmas, and all Dharmas are included within the Dharma body.

source: །ཆོས་ཀྱི་སྐུ་རྟག་པར་གནས་ཀྱང་རྟག་པའི་ལྟ་བར་ལྟུང་བར་མི་འགྱུར་རོ།
en: The Dharma body remains always, but it does not fall into the view of eternalism.

source: །འགག་པར་འགྱུར་ཡང་ཆད་པའི་ལྟ་བར་འགྱུར་བ་མ་ཡིན་པས་སེམས་ཅན་གྱི་ཐ་དད་པའི་ལྟ་བ་རྣམ་པ་སྣ་ཚོགས་རྣམ་པར་བཤིག་ནས་སེམས་ཅན་གྱི་ཡང་དག་པའི་ལྟ་བ་རྣམ་པ་སྣ་ཚོགས་བསྐྱེད་པར་མཛད་དོ།
en: It is cessation, but it does not fall into the view of nihilism. Therefore, it destroys the various different views of beings and gives rise to the various correct views of beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཆིང་བ་དགྲོལ་བར་མཛད་ཀྱང་དགྲོལ་བར་བྱ་བ་ཅི་ཡང་མི་མངའོ།
en: It liberates all beings from their bondage, but it has nothing it has to liberate. “

source: །སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པས་ཡོངས་སུ་མ་སྨིན་པ་གང་ཡིན་པ་དེ་ནི་ཡོངས་སུ་སྨིན་པར་མཛད་ལ། ཡོངས་སུ་སྨིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་གྲོལ་བར་མཛད་ཀྱང་མངོན་པར་འདུ་མཛད་པ་ཡང་མི་མངའ།
en: It generates the roots of goodness of beings, so that it ripens those who have not been ripened and liberates those who have been ripened, and yet it does not perform any activity.

source: །གཡོ་བ་ཡང་མི་མངའ་བས་འདུ་འཛི་ལས་ཐག་རིང་དུ་གྱུར་པ་རབ་ཏུ་དབེན་ཞིང་མཛད་པ་མི་མངའ་བས་རང་དབང་དུ་གྱུར་ཅིང་བདེ་བར་གྱུར་པ།
en: It has no instability and therefore is far from any preoccupations and is perfectly detached, and because of having no activity it is independent and blissful.

source: དུས་གསུམ་ལས་ཡང་དག་པར་འདས་ཀྱང་དུས་གསུམ་སྟོན་པར་མཛད་པ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ལས་ངེས་པར་འབྱུང་བ། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་བསྒྲུབ་པར་བྱ་བ།
en: It perfectly transcends the three times and yet it manifests the three times. It has risen above the field of experience of the śrāvakas and pratyekabuddhas and is accomplished by great bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་སྐུ་ཐ་དད་པར་གྱུར་པ་མེད་པ་ཡིན་ཏེ།
en: It is not different from the bodies of all tathāgatas.

source: འདི་དག་ཐམས་ཅད་ཀྱང་བསྐུལ་ཞིང་གསོལ་བ་བཏབ་པའི་དགེ་བའི་རྩ་བའི་སྟོབས་ཀྱིས་བརྙེས་པ་ཡིན་པའི་ཕྱིར་འདི་ལྟ་བུའི་ཆོས་ཀྱི་སྐུ་ངས་དེང་བརྙེས་པ་ཡིན་ཏེ།
en: All of this is attained through the power of the roots of goodness from requesting and supplication, and that is why I have now attained this kind of Dharma body.

source: དེ་ལྟ་བས་ན་གང་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་གཉེར་བར་འདོད་པས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཚིག་གཅིག་གམ། ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་གཞན་དག་ལ་སྟོན་པར་བྱེད་པའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་དེ་ཡང་ཚད་མེད་པར་གྱུར་པ་ཡིན་ན། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་ཡོངས་སུ་བསྐོར་བར་བསྐུལ་ཞིང་འཇིག་རྟེན་ན་ཡུན་རིང་དུ་བཞུགས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བར་གསོལ་བ་འདེབས་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: That being so, if whoever wishes to seek the highest, most complete enlightenment teaches just one word or one verse of this Dharma teaching to others, the good roots from that will be immeasurable, let alone requesting the tathāgatas to turn the great wheel of the Dharma and supplicating them not to pass into nirvāṇa but to remain in the world for a long time.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བརྒྱ་བྱིན་ལྷའི་དབང་པོས་ཡང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་གཉེར་ཞིང་ཐེག་པ་གསུམ་གྱི་ལམ་བསྒོམ་པར་འཚལ་བས་དགེ་བའི་རྩ་བ་ཅི་མཆིས་པ་ཇི་ལྟར་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་ཡོངས་སུ་བསྔོ་བར་བགྱི་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་བཀའ་སྩལ་པ།
en: Then Śakra, the lord of devas, asked the Bhagavat, “Bhagavat, how should a noble man or noble woman dedicate to the wisdom of omniscience all the good roots that come from seeking the highest, most complete enlightenment and meditating on the path of the three yānas?”

source: རིགས་ཀྱི་བུ་སེམས་ཅན་གང་དག་བྱང་ཆུབ་ཡོངས་སུ་གཉེར་ཞིང་ཐེག་པ་གསུམ་གྱི་ལམ་བསྒོམ་པས་དགེ་བའི་རྩ་བ་ཅི་ཡོད་པ་ཡོངས་སུ་བསྔོ་བར་འདོད་པ་དེས་ཉིན་མཚན་དུས་དྲུག་ཏུ་གུས་པས་སེམས་རྩེ་གཅིག་ཏུ་འདི་སྐད་ཅེས། བདག་གིས་ཐོག་མ་མེད་པའི་འཁོར་བ་ནས་དཀོན་མཆོག་གསུམ་པོ་དག་གི་ཐད་དུ་རྣལ་འབྱོར་བསྒོམས་པས་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་ཅི་ཡོད་པ་དང་། ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་སྲོག་ཆགས་དག་ལ་ཟན་ཆངས་གཅིག་ཙམ་བྱིན་པ་དང་། དགེ་བའི་ཚིག་གང་གིས་རྩོད་པ་དག་གི་བསྡུམས་བྱས་པ་དང་། དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་སོང་ནས་བསླབ་པའི་གནས་རྣམས་ཡང་དག་པར་བླངས་པ་དང་།
en: The Bhagavat said to Śakra, the lord of devas, “Noble son, those beingswho wish to dedicate whatever roots of goodness they have from seeking enlightenment and meditating on the path of the three yānas should in the six periods of the day and night say these words with veneration and a single-pointed mind: “ ‘Whatever good roots I have that have come from perfecting my practice focused upon the Three Jewels throughout beginningless saṃsāra, even down to giving a handful of food to a creature that has been born as an animal, such as resolving conflicts with virtuous words, having gone to the Three Jewels for refuge and perfectly taken up the training, having practiced purity through regret, and whatever good roots I have from requesting, supplicating, and rejoicing, I gather all that into one, and without feeling regret or loss, in my mind I give it completely to all beings. “ ‘

source: འགྱོད་ཚངས་བྱས་པ་དང་། བསྐུལ་ཞིང་གསོལ་བ་བཏབ་པ་དང་རྗེས་སུ་ཡི་རང་བའི་དགེ་བའི་རྩ་བ་ཇི་སྙེད་པ་དེ་དག་དེང་བདག་གིས་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ཏེ་འགྱོད་ཅིང་ཕངས་པ་མེད་པའི་སེམས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་བཏང་ངོ་། །རྣམ་པར་གྲོལ་བའི་ཕྱོགས་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་དེ་དག་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་ཅིང་གཟིགས་པ། དཔག་ཏུ་མེད་པ་དང་། ཐོགས་པ་མི་མངའ་བའི་རྣམ་པར་དག་པས་འདི་ལྟར་བསོད་ནམས་ཀྱི་དགེ་བའི་རྩ་བ་ཇི་སྙེད་པ་དག་ཐམས་ཅད་མཚན་མའི་སེམས་ལ་མི་གནས་ཤིང་མཚན་མའི་སེམས་ཀྱང་མི་སྤྱོད་པར་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་བཏང་བ་དེ་བཞིན་དུ།
en: The good roots within the aspect of liberation are those known and seen by the buddha bhagavats and have the purity of being measureless and without impediment, so that all such merit’s roots of goodness are given to all beings without remaining in a mind with features or rejecting a mind with features.

source: བདག་གིས་བསོད་ནམས་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་ཅི་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་གཏོང་སྟེ། ཐམས་ཅད་ཀྱིས་ཡིད་བཞིན་གྱི་ལག་པ་ཐོབ་ནས་ནམ་མཁའ་ལས་རིན་པོ་ཆེ་ཕྱུང་སྟེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རེ་བ་ཡོངས་སུ་བསྐང་བར་གྱུར་ཅིག །
en: In that same way, I dedicate all the roots of goodness that have arisen from merit to all beings so that they will all obtain hands with the power of wish-fulfillment, so that jewels fall from the sky, and all the hopes of beings will be fulfilled. “ ‘

source: ལོངས་སྤྱོད་ཟད་མི་ཤེས་པ་དང་། ཤེས་རབ་མཐར་ཐུག་པ་མེད་པ་དང་། དམ་པའི་ཆོས་ཀྱི་སྤོབས་པ་ཐོགས་པ་མེད་པ་ཐོབ་ནས་སེམས་ཅན་ཐམས་ཅད་ཐུན་མོང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཐོབ་པར་གྱུར་ཅིག །
en: May they attain enjoyments that know no end, wisdom that has no limit, and unimpeded eloquence in the sublime Dharma, and may all beings attain together the highest, most complete enlightenment of buddhahood and attain omniscience. “ ‘

source: དགེ་བའི་རྩ་བ་འདིའི་རྒྱུས་དགེ་བའི་ཆོས་ཚད་མེད་པ་བསྐྱེད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ།
en: I dedicate all the immeasurable good qualities that are produced by this good root to the highest enlightenment. “ ‘
